# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rg_dp_stag: Read complete after 0s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 2s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 0s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 0s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.k6tests will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k6tests" {
        id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
        name                                = "k6tests-cluster"
        tags                                = {}
        # (37 unchanged attributes hidden)

      - oms_agent {
          - log_analytics_workspace_id      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.OperationalInsights/workspaces/k6tests-law" -> null
          - msi_auth_for_monitoring_enabled = true -> null
          - oms_agent_identity              = [] -> null
        }

        # (6 unchanged blocks hidden)
    }

  # azurerm_log_analytics_workspace.k6tests will be destroyed
  # (because azurerm_log_analytics_workspace.k6tests is not in configuration)
  - resource "azurerm_log_analytics_workspace" "k6tests" {
      - allow_resource_only_permissions         = true -> null
      - cmk_for_query_forced                    = false -> null
      - daily_quota_gb                          = 5 -> null
      - id                                      = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.OperationalInsights/workspaces/k6tests-law" -> null
      - immediate_data_purge_on_30_days_enabled = false -> null
      - internet_ingestion_enabled              = true -> null
      - internet_query_enabled                  = true -> null
      - local_authentication_disabled           = false -> null
      - location                                = "norwayeast" -> null
      - name                                    = "k6tests-law" -> null
      - primary_shared_key                      = (sensitive value) -> null
      - resource_group_name                     = "k6tests-rg" -> null
      - retention_in_days                       = 30 -> null
      - secondary_shared_key                    = (sensitive value) -> null
      - sku                                     = "PerGB2018" -> null
      - workspace_id                            = "df5c1fe8-d522-4804-9bfd-f1391b95ae7b" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_monitor_data_collection_rule.k6tests will be destroyed
  # (because azurerm_monitor_data_collection_rule.k6tests is not in configuration)
  - resource "azurerm_monitor_data_collection_rule" "k6tests" {
      - description                 = "DCR for Azure Monitor Container Insights" -> null
      - id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr" -> null
      - immutable_id                = "dcr-a4171c1b8acb4c61881bf5fd2c6329c9" -> null
      - location                    = "norwayeast" -> null
      - name                        = "k6tests-dcr" -> null
      - resource_group_name         = "altinn-monitor-test-rg" -> null
        # (2 unchanged attributes hidden)

      - data_flow {
          - destinations       = [
              - "ciworkspace",
            ] -> null
          - streams            = [
              - "Microsoft-ContainerLog",
            ] -> null
            # (3 unchanged attributes hidden)
        }

      - data_sources {
          - extension {
              - extension_json = jsonencode(
                    {
                      - dataCollectionSettings = {
                          - enableContainerLogV2   = false
                          - interval               = "1m"
                          - namespaceFilteringMode = "Include"
                          - namespaces             = [
                              - "dialogporten",
                              - "correspondence",
                            ]
                        }
                    }
                ) -> null
              - extension_name = "ContainerInsights" -> null
              - name           = "ContainerInsightsExtension" -> null
              - streams        = [
                  - "Microsoft-ContainerLog",
                ] -> null
            }
        }

      - destinations {
          - log_analytics {
              - name                  = "ciworkspace" -> null
              - workspace_resource_id = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.OperationalInsights/workspaces/k6tests-law" -> null
            }
        }
    }

  # azurerm_monitor_data_collection_rule_association.k6tests will be destroyed
  # (because azurerm_monitor_data_collection_rule_association.k6tests is not in configuration)
  - resource "azurerm_monitor_data_collection_rule_association" "k6tests" {
      - data_collection_rule_id     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/altinn-monitor-test-rg/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr" -> null
      - description                 = "Association of container insights data collection rule. Deleting this association will break the data collection for this AKS Cluster." -> null
      - id                          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/providers/Microsoft.Insights/dataCollectionRuleAssociations/ContainerInsightsExtension" -> null
      - name                        = "ContainerInsightsExtension" -> null
      - target_resource_id          = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.Authorization/roleAssignments/5f298aef-189f-9015-656e-5235416652e5" -> (known after apply)
      ~ name                                   = "5f298aef-189f-9015-656e-5235416652e5" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.Authorization/roleAssignments/e2586b1b-e003-b822-18cd-b59d1776fbd6" -> (known after apply)
      ~ name                                   = "e2586b1b-e003-b822-18cd-b59d1776fbd6" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-test-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.Authorization/roleAssignments/3edfe5a2-b829-c190-b6e4-3d0d31588896" -> (known after apply)
      ~ name                                   = "3edfe5a2-b829-c190-b6e4-3d0d31588896" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-yt01-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.Authorization/roleAssignments/1967b355-f40f-61db-5615-812a7fd19809" -> (known after apply)
      ~ name                                   = "1967b355-f40f-61db-5615-812a7fd19809" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
        id                         = "kube-prometheus-stack"
        name                       = "kube-prometheus-stack"
      ~ version                    = "67.9.0" -> "68.3.2"
        # (27 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`